<script type="text/javascript" src="../assets/js/jquery.maphilight.min.js"></script>

<div class="map_wrapper" style="top: 20px;position: relative;">
		
	<div class='regionInfo' style="width:300px; height:100px; float: left; margin-left: 675px;">
		Наведите на район, чтобы узнать стоимость доставки.
	</div>
	
	<div class="map" style="display: block; background-image: url(../assets/img/map.png); background-repeat: no-repeat; position: relative; padding: 0px; width: 960px; height: 410px;">
		<img class="map maphilighted" src="../assets/img/map.png" height="410px" usemap="#samara" style="opacity: 0; position: absolute; left: 0px;  padding: 0px; border: 0px;">
	</div>
	
	<map name="samara">
	<area shape="poly" alt="" 
	title="Самарский" 
	regionInfo='Доставка: 100' 
	coords="10,394,22,378,21,369,27,361,40,338,58,314,112,336,95,369,87,367,76,368,63,373,47,381,37,387,33,384,30,385,30,387,31,390,27,393,19,399" href="" target="" />
	
	<area shape="poly" alt="" 
	title="Ленинский" 
	regionInfo='Доставка: 200' 
	coords="125,255,156,296,173,282,218,281,204,291,207,295,176,318,168,309,142,323,129,317,120,339,59,314,77,289,101,271,115,261" href="" target="" />
	
	<area shape="poly" alt="" 
	title="Железнодорожный" 
	regionInfo='Доставка: 300' 
	coords="286,292,289,367,293,383,302,378,306,385,310,382,311,392,308,400,294,403,273,406,250,407,242,406,238,407,233,403,229,407,220,400,214,394,205,388,194,382,182,376,171,373,162,373,156,373,151,367,142,366,142,372,134,371,130,376,128,377,124,377,121,374,120,368,119,363,114,364,112,368,100,360,112,336,120,340,129,318,141,323,143,323,168,310,176,319,209,295,203,290,218,280,229,294,284,292" href="" target="" />
	
	<area shape="poly" alt="" 
	title="Октябрьский" 
	regionInfo='Доставка: 400' 
	coords="243,129,265,154,280,154,285,168,301,175,295,192,315,216,282,242,286,293,230,293,219,280,175,282,157,295,125,255,147,239,153,244,167,233,162,228,180,217,206,186,220,168,234,147" href="" target="" />
	
	<area shape="poly" alt="" 
	title="Советский" 
	regionInfo='Доставка: 500' 
	coords="323,189,369,249,388,235,396,245,414,232,422,241,416,247,419,250,420,254,420,255,424,259,435,250,442,260,462,245,470,256,464,260,471,271,445,288,425,282,401,290,414,309,445,289,474,324,479,325,483,338,483,340,471,350,479,359,471,362,463,365,448,361,441,351,437,353,437,360,433,359,431,357,433,352,427,348,415,357,409,358,399,368,380,368,369,360,360,366,359,370,356,372,352,371,335,391,329,389,309,400,311,385,309,382,307,384,302,378,293,383,289,367,286,295,282,242,315,215,305,203,322,189" href="" target="" />
	
	<area shape="poly" alt="" 
	title="Промышленный" 
	regionInfo='Доставка: 600' 
	coords="282,1,306,28,315,20,355,39,359,45,371,49,392,70,357,102,358,111,395,155,390,162,424,206,429,203,449,230,485,201,490,203,504,225,505,232,535,271,529,275,532,289,524,315,529,319,526,325,529,333,527,339,533,349,538,348,537,353,532,358,519,361,501,363,486,362,483,360,478,358,471,350,484,339,478,323,473,323,445,290,415,310,401,289,426,282,445,287,471,271,466,261,464,260,470,256,463,246,462,245,441,260,436,251,434,249,424,259,419,255,419,250,415,247,423,241,414,232,396,245,388,234,369,249,323,189,305,203,295,193,302,174,285,167,280,153,265,154,243,128,256,87,272,33,280,6" href="" target="" />
	
	<area shape="poly" alt="" 
	title="Кировский, Зубчаниновка" 
	regionInfo='Доставка: 700' 
	coords="602,53,618,60,618,63,628,69,630,75,650,87,662,99,663,106,644,123,652,122,655,128,651,132,654,135,658,132,656,150,653,159,648,162,642,153,636,153,633,147,634,149,613,155,592,164,562,183,558,178,554,182,558,187,544,195,561,213,545,224,561,246,566,249,564,256,556,258,556,266,564,271,559,275,552,270,546,273,541,279,533,289,529,276,535,271,506,232,505,224,491,202,485,200,449,229,429,202,424,205,390,162,395,155,376,132,359,111,358,103,392,70,371,49,358,44,356,38,360,34,365,36,372,20,394,47,398,44,403,50,404,54,410,51,411,53,400,67,402,68,406,66,419,82,410,90,421,103,429,103,449,89,453,102,458,106,461,106,506,74,515,83,521,85,526,73,540,78,537,90,538,91,543,90,559,60,567,56,573,55,597,59,601,53" href="" target="" />
	</map>

</div>
<script>
	var regionInfo = '';

	$(function() {
		$('.map').maphilight();
	});

	$('area').click(function(){
		return false;
	});

	$('area').mouseleave(function(){
		$('div.regionInfo').html('Наведите на район, чтобы узнать стоимость доставки.');
	});

	$('area').mouseover(function(){
		regionInfo =  $( this ).attr('title') + '<br/>' + $( this ).attr('regionInfo');
		$('div.regionInfo').html(regionInfo);
	});

	$.fn.maphilight.defaults = {
	fill: true,
	fillColor: '000000',
	fillOpacity: 0.2,
	stroke: true,
	strokeColor: 'ff0000',
	strokeOpacity: 1,
	strokeWidth: 1,
	fade: true,
	alwaysOn: false,
	neverOn: false,
	groupBy: false,
	wrapClass: true,
	shadow: false,
	shadowX: 0,
	shadowY: 0,
	shadowRadius: 6,
	shadowColor: '000000',
	shadowOpacity: 0.8,
	shadowPosition: 'outside',
	shadowFrom: false }
</script>
